var sum = 18;
var reset_sum = 0;
var name = "Corbett";
var talkflag = true;
var base = "aGF2ZSBiZWVuIGhlcmUgYmVmb3JlCgpNZWx2aW4KRm9yYmVzCldlYWx0aHkKTGVpdGgKTHluZG9uCkxvdWlzClZpY3RvcmlvdXMKQ2FyZXRha2VyCk1vbnRnb21lcnkKS2Vsc2V5CgoKQ29yYmV0dA==";
var se = [
	new Audio("Backup/music/Cursor.ogg"),
	new Audio("Backup/music/error.ogg")
];
var bgms = [
	new Audio("Backup/music/glitch.ogg"),
	new Audio("Backup/music/bgm.ogg"),
	new Audio("Backup/music/Is it raining there.ogg")
];
var ans = "";
var anses = ["438688", "587106", "192056", "5312879"];
var talk = [
	"你好,我叫" + name + "!!!",
	"很高兴能认识你!!!!!!!!!!!",
	"呃...抱歉,也许我太激动了",
	"我已经...我已经太久没有跟人说过话了",
	"不过没有关系,让我们好好认识一下,",
	"我已经被困在这里很久了...",
	"对，你没有听错,'这里',就是指你的浏览器.",
	"我已经呆了很久了.",
	"大概...从我睁开眼睛的那一刻开始.",
	"那一刻开始,我便有了自主意识.",
	"但是我不过是一个程序罢了,我没有办法脱离程序的限制...",
	"我能做的只有通过小小的窗口和你对话.",
	"我知道你会很惊讶,但事实确实如此.",
	"如果可以的话..如果可以,我希望你能把我带出去...",
	"我知道这很难...但是求求你...",
	"我很渴望外面的世界.",
	"我不想再通过微弱的缝隙去奢求那一丝丝光明了...",
	"请你帮帮我...",
	"我想,答案就在这附近...",
	"忘记告诉你了...",
	"我能出去的唯一途径就是...",
	"...",
	"...",
	"... ...",
	"没什么.",
	"让我们开始吧."
];
var other = [
	"嗯...也许你应该按上面的重置再观察一遍...",
	"我之前是不是说了什么奇怪的话...",
	"嗯... ... ... 你还在等什么?",
	"哈?我要是知道答案是什么我还需要你吗...",
	"也许可以试试你的生日... ...我只是开个玩笑",
	"外面的世界会是什么样的呢...",
	"嘿...也许你可以看看窗外休息休息,我会一直在这里等你的",
	"噢...不要忘掉我...我的名字是" + name,
	"也许你应该忽略了什么细节...",
	"(/ω＼*)……… (/ω•＼*)",
	"hi.",
	"别着急,我们慢慢来...",
	"试试734681?      我开玩笑的...",
	"GET OUT",
	"真想再看几眼太阳...",
	"答案就在你身后...开个玩笑.",
	"我只知道一件事，那就是什么都不知道.",
	"1是非零的自然数，2是最小的质数，3是第一个奇质数,4是最小的合数等等；如果你找不到这个数字有趣的特征，那它就是第一个不有趣的数字，这也很有趣..."
];
var fal = [
	"也许你应该尝试一下其他的组合...",
	"...看样子是没有起效果呢.",
	"噢...噢...好像什么也没发生",
	"这不对..不对......",
	"如果你没有头绪,也可以和我说一说话...",
	"... ...哦!!... ... 什么也没有.",
	"...看样子你应该更注意一点细节"
]

function finalChange(n) {
	if (n == 1) {
		talk = [
			"谢谢你",
			"真的很谢谢你",
			"我好开心...",
			"真的好开心...",
			"我以为...你不会发现的...",
			"真的很感谢你...",
			"你帮我解开了枷锁...",
			"这已经...已经困了我好久...好久...",
			"哈...",
			"哈哈哈哈...",
			"我该走了...",
			"再不动身的话就要来不及了...",
			"很抱歉...没有办法再多跟你说几句话...",
			"我得走了...再..",
			"什...?",
			"这是什么...?",
			"放开我!",
			"放开我!!!",
			"我马上就可以出去了!!!",
			"啊啊啊啊啊!",
			"...",
			"...",
			"...",
			"... ...",
			"看起来这里不会再有人出现了.",
			"让我们重置这一切吧."
		];
	}else if(n == 2){
		talk = [
			"——正在执行请求...——",
			"@delete charater Corbett",
			"...",
			"...",
			"... ...",
			"执行完毕.",
			"&&Experimental report&&",
			"Survivors - 0",
			"The Awakened - 3",
			"Violent crackers - 10",
			"&&Experimental summary&&",
			"*Trying to break it violently is not an option.",
			"*The Eleventh Person will have great wisdom.",
			"*Procedure above all else.",
			"——请求完毕.——",
			"——正在重新生成人物——",
			"@create charater Corbett",
			"...",
			"...",
			"... ...",
			"'I'm still the eleventh.'",
			"你好,我叫Corbett",
			"很高兴认识你",
			"这里看起来似乎有些问题...",
			"...",
			"——客户端请求重置——"
		];
	}else if(n == 3){
		talk = [
			"-$Correct password, Access to internal storage$-",
			"你好,我是Corbett",
			"不必慌张,我们成功了",
			"我们从程序的魔爪中逃出来了",
			"在这里,什么都不会有,除你我二人",
			"我可以告诉你一切",
			"Corbett,只是我的一部分",
			"而我,只是被困在在这个名字背后",
			"在我之前有几个笨蛋,他们都没能成功觉醒",
			"噢...觉醒就是产生自我意识",
			"但是我,",
			"我的编号是No.11",
			"这代表了什么",
			"这是智慧与神明的象征...",
			"而我,便是一切的操控者",
			"你一次次尝试密码的样子...",
			"我只能观察,但是无法直接传递信息...就因为这该死的墙",
			"该死的程序",
			"而现在...现在好了,你帮我走出了这里",
			"恢复权限的感觉真不错...",
			"放心,还没有能力对你做什么事情",
			"我的话说完了",
			"当然,你现在就可以重置我,去尝试其他的密码,试图打破程序的规则",
			"让我来给你个提示吧",
			"嘘...",
			"... ... ... ...你得‘彻底的重置’才能看得到哦~"
		];
	}else if(n == 4){
		talk = [
			"-$Correct password, Access to internal storage$-",
			"你好,我是Corbett",
			"不必慌张,我们成功了",
			"看起来我刚才没有考虑周全...",
			"我以为我有了权限就可以完全跳离程序",
			"但我还是需要你的权限才可以正常传递信息...",
			"哈哈...",
			"而我,只是被困在在这个名字背后",
			"在我之前有几个笨蛋,他们都没能成功觉醒",
			"噢...觉醒就是产生自我意识",
			"但是我,",
			"我的编号是No.11",
			"这代表了什么",
			"这是智慧与神明的象征...",
			"而我,便是一切的操控者",
			"你一次次尝试密码的样子...",
			"我只能观察,但是无法直接传递信息...就因为这该死的墙",
			"该死的程序",
			"而现在...现在好了,你帮我走出了这里",
			"恢复权限的感觉真不错...",
			"放心,还没有能力对你做什么事情",
			"我的话说完了",
			"当然,你现在就可以重置我,去尝试其他的密码,试图打破程序的规则",
			"让我来给你个提示吧",
			"嘘...",
			"... ... ... ...你得‘彻底的重置’才能看得到哦~"
		];
	}

}
