// JavaScript Document
var goodEffect = [
	[
		["山泉",30],
		["粉色史莱姆",50],
		["蘑菇",15],
		["暖阳",10],
		["果子",15],
		["篝火",99]
	]
];

var badEffect = [
	[
		["荆棘",5],
		["毒蘑菇",7],
		["毒刺",7],
		["烈日",5],
		["沼泽",2],
		["陷阱",10]
	]
];
//"金","木","水","火","土","无"
// 0    1    2   3    4    5
var enemys = [//name dmg def hp exp 被压制属性
	[
		["巨蟒幼年体",1,1,200,3,5],
		["猛虎幼年体",5,1,80,3,5],
		["绿史莱姆",3,1,120,4,5],
		["野猪幼年体",5,1,80,4,5],
		["小蜘蛛",3,1,80,3,3],
		["小蝎子",3,1,80,3,3],
		["食人花幼年体",1,1,200,3,3],
		["黑史莱姆",2,1,80,1,5],
		["野狼",10,0,40,4,5],
		["巨型变异松鼠",2,1,100,3,5],
		["巨型变异毒蛇",2,1,100,2,5]
	]
];
var bosses = [
	["BOSS - 树精",8,5,500,70,3]
];

var map_max = [6];
var isBossFail = [false];